Table of Contents
 Enum TypeDeflectionSheme
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Scheme
public enum TypeDeflectionSheme
Fields
DeflectionSheme_I = 0
constant moment - single span
DeflectionSheme_II = 1
one single force - single span
DeflectionSheme_III = 2
single moment at the begging or end of the span - single span
DeflectionSheme_IV = 3
two forces - single span
DeflectionSheme_IX = 8
triangle distributed loads - cantilever
DeflectionSheme_V = 4
linear distributed loads - single span
DeflectionSheme_VI = 5
triangle distributed loads - single span
DeflectionSheme_VII = 6
linear distributed loads, moments in the left and right - continues beam
DeflectionSheme_VIII = 7
one single force - cantilever
DeflectionSheme_X = 9
one single force - non continues span
DeflectionSheme_XI = 10
trapezoidal shape of loads
Fields
 Name |  Description
 DeflectionSheme_I = 0
constant moment - single span
 DeflectionSheme_II = 1
one single force - single span
 DeflectionSheme_III = 2
single moment at the begging or end of the span - single span
 DeflectionSheme_IV = 3
two forces - single span
 DeflectionSheme_IX = 8
triangle distributed loads - cantilever
 DeflectionSheme_V = 4
linear distributed loads - single span
 DeflectionSheme_VI = 5
triangle distributed loads - single span
 DeflectionSheme_VII = 6
linear distributed loads, moments in the left and right - continues beam
 DeflectionSheme_VIII = 7
one single force - cantilever
 DeflectionSheme_X = 9
one single force - non continues span
 DeflectionSheme_XI = 10
trapezoidal shape of loads
 Edit this page